tutorials/rhoImplicitPorousSimpleFoam/angledDuctImplicit/constant/porousZones
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          porousZones;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

1
(
    porosity
    {
        e1        (0.70710678 0.70710678 0);
        e2        (0 0 1);

        Darcy
        {
            d         d [0 -2 0 0 0 0 0] (5e7 5e10 5e10);
            f         f [0 -1 0 0 0 0 0] (0 0 0);
        }
    }
)

// ************************************************************************* //
