tutorials/rhoImplicitPorousSimpleFoam/angledDuctImplicit/0/p
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "";
    case "";
    instance ""0"";
    local "";

    class volScalarField;
    object p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.0e5;

boundaryField
{
    front
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }
    wall
    {
        type            zeroGradient;
    }
    porosityWall
    {
        type            zeroGradient;
    }

    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 1.0e5;
    }
}

// ************************************************************************* //
