tutorials/rhoImplicitPorousSimpleFoam/angledDuctImplicit/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p GAMG
    {
        tolerance        1e-8;
        relTol           0.05;

        smoother         GaussSeidel;

        cacheAgglomeration off;

        nCellsInCoarsestLevel 20;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

    h PBiCG
    {
        preconditioner
        {
            type        DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-6;
        relTol           0.1;
    };

    k smoothSolver
    {
        smoother         GaussSeidel;
        nSweeps          2;
        tolerance        1e-7;
        relTol           0.1;
    };

    epsilon smoothSolver
    {
        smoother         GaussSeidel;
        nSweeps          2;
        tolerance        1e-7;
        relTol           0.1;
    };
}

SIMPLE
{
    nUCorrectors                 2;
    nNonOrthogonalCorrectors     0;
    pMin                         pMin   [1 -1 -2 0 0 0 0] 100;
    pressureImplicitPorousity    yes;
}

relaxationFactors
{
    p           0.3;
    rho         1;
    U           0.7;
    k           0.9;
    epsilon     0.9;
    h           0.9;
}

// ************************************************************************* //
